In [6]:
import pandas as pd
sales = pd.read_excel('sales.xlsx', index_col = [1])

In [7]:
sales

                         Market  No_of_Orders    Profit      Sales
Region
Western Africa           Africa           251 -12901.51   78476.06
Southern Africa          Africa            85  11768.58   51319.50
North Africa             Africa           182  21643.08   86698.89
Eastern Africa           Africa           110   8013.04   44182.60
Central Africa           Africa           103  15606.30   61689.99
Western Asia       Asia Pacific           382 -16766.90  124312.24
Southern Asia      Asia Pacific           469  67998.76  351806.60
Southeastern Asia  Asia Pacific           533  20948.84  329751.38
Oceania            Asia Pacific           646  54734.02  408002.98
Eastern Asia       Asia Pacific           414  72805.10  315390.77
Central Asia       Asia Pacific            37  -2649.76    8190.74
Western Europe           Europe           964  82091.27  656637.14
Southern Europe          Europe           338  18911.49  215703.93
Northern Europe          Europe           367  43237.44  252969.09
Eastern Europe           Europe           241  25050.69  108258.93
South America             LATAM           496  12377.59  210710.49
Central America           LATAM           930  74679.54  461670.28
Caribbean                 LATAM           288  13529.59  116333.05
Western US                 USCA           490  44303.65  251991.83
Southern US                USCA           255  19991.83  148771.91
Eastern US                 USCA           443  47462.04  264973.98
Central US                 USCA           356  33697.43  170416.31
Canada                     USCA            49   7246.62   26298.81

In [8]:
sales["Sales"]

Region
Western Africa        78476.06
Southern Africa       51319.50
North Africa          86698.89
Eastern Africa        44182.60
Central Africa        61689.99
Western Asia         124312.24
Southern Asia        351806.60
Southeastern Asia    329751.38
Oceania              408002.98
Eastern Asia         315390.77
Central Asia           8190.74
Western Europe       656637.14
Southern Europe      215703.93
Northern Europe      252969.09
Eastern Europe       108258.93
South America        210710.49
Central America      461670.28
Caribbean            116333.05
Western US           251991.83
Southern US          148771.91
Eastern US           264973.98
Central US           170416.31
Canada                26298.81
Name: Sales, dtype: float64

In [9]:
sales.Sales

Region
Western Africa        78476.06
Southern Africa       51319.50
North Africa          86698.89
Eastern Africa        44182.60
Central Africa        61689.99
Western Asia         124312.24
Southern Asia        351806.60
Southeastern Asia    329751.38
Oceania              408002.98
Eastern Asia         315390.77
Central Asia           8190.74
Western Europe       656637.14
Southern Europe      215703.93
Northern Europe      252969.09
Eastern Europe       108258.93
South America        210710.49
Central America      461670.28
Caribbean            116333.05
Western US           251991.83
Southern US          148771.91
Eastern US           264973.98
Central US           170416.31
Canada                26298.81
Name: Sales, dtype: float64

In [17]:
#Loc : index
sales.loc["Southern Asia"]

Market          Asia Pacific
No_of_Orders             469
Profit               67998.8
Sales                 351807
Name: Southern Asia, dtype: object

In [18]:
sales.loc["Southern Asia", "Profit"]

67998.76

In [19]:
sales.iloc[0]

Market           Africa
No_of_Orders        251
Profit         -12901.5
Sales           78476.1
Name: Western Africa, dtype: object

In [20]:
sales.iloc[0, 3]

78476.06

In [22]:
sales.loc[:, ["Market", "Profit", "Sales"]].head()

                 Market    Profit     Sales
Region
Western Africa   Africa -12901.51  78476.06
Southern Africa  Africa  11768.58  51319.50
North Africa     Africa  21643.08  86698.89
Eastern Africa   Africa   8013.04  44182.60
Central Africa   Africa  15606.30  61689.99

In [23]:
sales.iloc[:, [0, 2, 3]].head()

                 Market    Profit     Sales
Region
Western Africa   Africa -12901.51  78476.06
Southern Africa  Africa  11768.58  51319.50
North Africa     Africa  21643.08  86698.89
Eastern Africa   Africa   8013.04  44182.60
Central Africa   Africa  15606.30  61689.99

In [25]:
sales.loc[["Western Africa","Southern Africa", "Eastern Africa"], :]

                 Market  No_of_Orders    Profit     Sales
Region
Western Africa   Africa           251 -12901.51  78476.06
Southern Africa  Africa            85  11768.58  51319.50
Eastern Africa   Africa           110   8013.04  44182.60

In [29]:
sales.iloc[1:4, :]

                 Market  No_of_Orders    Profit     Sales
Region
Southern Africa  Africa            85  11768.58  51319.50
North Africa     Africa           182  21643.08  86698.89
Eastern Africa   Africa           110   8013.04  44182.60

In [31]:
sales["Sales"] > 300000

Region
Western Africa       False
Southern Africa      False
North Africa         False
Eastern Africa       False
Central Africa       False
Western Asia         False
Southern Asia         True
Southeastern Asia     True
Oceania               True
Eastern Asia          True
Central Asia         False
Western Europe        True
Southern Europe      False
Northern Europe      False
Eastern Europe       False
South America        False
Central America       True
Caribbean            False
Western US           False
Southern US          False
Eastern US           False
Central US           False
Canada               False
Name: Sales, dtype: bool

In [34]:
sales2 = sales[sales["Sales"] > 300000]

In [35]:
sales2

                         Market  No_of_Orders    Profit      Sales
Region
Southern Asia      Asia Pacific           469  67998.76  351806.60
Southeastern Asia  Asia Pacific           533  20948.84  329751.38
Oceania            Asia Pacific           646  54734.02  408002.98
Eastern Asia       Asia Pacific           414  72805.10  315390.77
Western Europe           Europe           964  82091.27  656637.14
Central America           LATAM           930  74679.54  461670.28

### Concatenation of DataFrames

In [2]:
str1 = "sdfgs"
str2 = "sdfsd"
str1 + str2

'sdfgssdfsd'

In [3]:
df_1 = {"col1":[1, 2, 3,4], "col2":[5, 6, 7, 8]}
df_2 = {"col1":[9, 10, 11,12], "col2":[15, 16, 17, 18]}

In [4]:
import pandas as pd

In [5]:
df1 = pd.DataFrame(df_1)
df2 = pd.DataFrame(df_2)

In [7]:
df1

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [8]:
df2

   col1  col2
0     9    15
1    10    16
2    11    17
3    12    18

In [11]:
pd.concat([df1, df2], axis = 0)

#axis = 0 : Row 
#axis = 1 : Column

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8
0     9    15
1    10    16
2    11    17
3    12    18

In [12]:
pd.concat([df1, df2], axis = 1)

#axis = 0 : Row 
#axis = 1 : Column

   col1  col2  col1  col2
0     1     5     9    15
1     2     6    10    16
2     3     7    11    17
3     4     8    12    18

In [13]:
x = pd.concat([df1, df2], axis = 1)

In [14]:
x

   col1  col2  col1  col2
0     1     5     9    15
1     2     6    10    16
2     3     7    11    17
3     4     8    12    18

In [19]:
df1 + df2

   col1  col2
0    10    20
1    12    22
2    14    24
3    16    26

In [20]:
l1 = [1, 2, 3, 3]
l2 = [3, 4, 5, 6]

l1 + l2

[1, 2, 3, 3, 3, 4, 5, 6]

In [21]:
df1.add(df2)

   col1  col2
0    10    20
1    12    22
2    14    24
3    16    26

In [23]:
df1 % df2

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [24]:
df1.mod(df2)

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [25]:
df1.mul(df2)

   col1  col2
0     9    75
1    20    96
2    33   119
3    48   144

In [31]:
df_3 = {"col1":[1, 2, 3,4], "col2":[True, False, True, False]}
df_4 = {"col1":[9, 10, 11,12], "col2":[15, True, 17, 18]}

In [32]:
df3 = pd.DataFrame(df_3)
df4 = pd.DataFrame(df_4)

In [38]:
df3 + df4

   col1 col2
0    10   16
1    12    1
2    14   18
3    16   18